* This function is no longer used but could parse a CSV file for us if needed
#+BEGIN_SRC emacs-lisp :results silent :tangle yes
(defun parse-csv-file (file)
    (interactive
     (list (read-file-name "CSV file: ")))
    (let ((buf (find-file-noselect file))
          (result nil))
      (with-current-buffer buf
        (goto-char (point-min))
        (while (not (eobp))
          (let* ((line (buffer-substring-no-properties
                        (line-beginning-position) (line-end-position)))
                 (quotelessline (replace-regexp-in-string "\"" "" line)))
            (push (split-string quotelessline ",") result))
          (forward-line 1)))
          (rself.boxSize:everse result)))
#+END_SRC

#+BEGIN_SRC elisp :results value
(parse-csv-file "practice-exercises.csv")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp :var table=rule-5-example-1
table
#+END_SRC

#+RESULTS:
| 51 | 6 | 6 | 6 |
| 52 | 1 | 3 | 2 |
| 53 | 5 | 2 | 4 |
| 54 | 2 | 1 | 1 |
| 55 | 3 | 4 | 3 |
| 56 | 4 | 5 | 5 |
* TODO Functions
#+BEGIN_SRC emacs-lisp :var table=mixed-rules-example-1
  (defun eval-without-buffer (table) 
        (insert (format "#+BEGIN_SRC elisp :var table=%s \n(setq mixed (append table mixed))\n#+END_SRC\n" table))
        (org-ctrl-c-ctrl-c) ; same as typing ", ,"
        (goto-char (point-min))
        (kill-line 5))

    (defun build-mixed-symbols ()
      (setq mixed-symbols
          (loop for x from 1 to 150
              collect (string-to-symbol (concat "mixed-rules-example-" (number-to-string x))))))
#+END_SRC

#+RESULTS:
: build-mixed-symbols

#+BEGIN_SRC elisp :results silent
  (defun org-element-tree ()
    (let ((file-path "oet.el")
          (org-element-tree (org-element-parse-buffer))
          (print-circle t))
      (with-temp-buffer
        (insert "(setq oet '")
        (pp org-element-tree (current-buffer))
        (insert ")\n")
        (write-file file-path))
      t))

  (defun parse-table (data)
    (let* ((interpreted (org-element-interpret-data data))
           (table-contents-as-list-of-strings (split-string interpreted "\n"))
           (table-contents (mapcar (lambda (x) (split-string x "|"))
                                   (cdr table-contents-as-list-of-strings))))
      (mapcar (lambda (row)
                (loop for entry in row
                      if (and (stringp entry) (plusp (length entry)))
                      collect (string-to-number entry)))
              table-contents)))

  (defun parse-tables-and-set-table-symbols ()
    (setq table-symbols nil)
    (org-element-map (org-element-parse-buffer)
        'table
      (lambda (data)
        (let (table-name table-symbol)
          (setq table-name (org-element-property :name data))
          (when (not (null table-name))
            (setq table-symbol (intern table-name))
            (set table-symbol (remove-if 'null (parse-table data)))
            (push table-symbol table-symbols)))))
    (reverse table-symbols))
#+END_SRC

Note: this splits the train and test data. Yes it's a mess. I am working on making this easier. 
#+BEGIN_SRC emacs-lisp :results silent
  (setq tables (parse-tables-and-set-table-symbols)
        data (subseq tables 0 488)
        targets (subseq tables 489))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun format-results (dance)
    (mapcar 'car (sort (score-single-dance dance) (lambda (a b) (< (cadr a) (cadr b))))))
  (defun format-answer (answer)
    (remove-if 'zerop answer))
  (defun test-dance-scoring (dance-num)
    (format-results (symbol-value (elt data (1- dance-num)))))
  (defun test-dance-results (answer-num)
    (format-answer (elt ultimate-table (1- answer-num))))
  (list (format-results rule-5-example-18)
        (format-answer (elt (transpose rule-5-answers-11-20) 7)))
#+END_SRC

#+RESULTS:
| 4 | 2 | 3 | 6 | 5 | 1 |
| 4 | 2 | 3 | 6 | 5 | 1 |

* TODO Test Rule 8:
#+BEGIN_SRC emacs-lisp :results value
  (loop for dance from 147 to 199
        if (not (equal (setq prediction (test-dance-scoring dance))
                       (setq target (test-dance-results dance))))
        collect (list dance prediction target))
 #+END_SRC

 #+RESULTS:
 | 147 | (1.5 1.5 3 7 5 6 4) | (1.5 1.5 3 7 5.5 5.5 4) |
 | 151 | (1 2.5 5 4 2.5)     | (1 3.5 5 2 3.5)         |
 | 159 | (4.5 6 2 3 1 4.5)   | (5.5 7 2 3 1 5.5 4)     |
 | 162 | (6 3 1 2 5 4)       | (3 4 1 2 6 5)           |
 | 170 | (2 5 1 4 6 3)       | (3 5 1 4 6 2)           |
 | 176 | (3 4 2 1)           | (4 3 2 1)               |
 | 177 | (1 5 4 6 3 7 2)     | (1 4 5 6 3 7 2)         |
 | 180 | (5 3 1.5 1.5 4)     | (5 3 1 2 4)             |
 | 182 | (2 6 4 1 3 5)       | (2 5 4 1 3 6)           |
 | 184 | (2 5 4 6 1 3)       | (3 2 5 6 1 4)           |
 | 185 | (2 4 3 6 1 5)       | (2 5 3 6 1 4)           |
 | 186 | (2 6 3 4 1 5)       | (2 6 3 4.5 1 4.5)       |
 | 188 | (2 1 5 4 6 3)       | (2 1 6 4 5 3)           |
 | 190 | (4 1 3 2)           | (4 1 3 2 5.5 5.5)       |
 | 193 | (4 1 2.5 2.5 7 6 5) | (4 1 2.5 2.5 7 6 5 8)   |

